In [127]:
import boto3
import pandas as pd
#create region where the server is located
region = "eu-west-1"
#initialize the s3 resource
s3_client = boto3.client('s3', region_name = region)
#location constraint for s3 bucket
location = {"LocationConstraint": region}
#create bucket
bucket = "blossom-data-eng-jefferson"
s3_client.create_bucket(Bucket = bucket,
                       CreateBucketConfiguration = location)

In [6]:
#Download the file
s3_client.download_file("blossom-data-engs", "free-7-million-company-dataset.zip", 
                        "free-7-million-company-dataset.zip")

In [119]:
#read with pandas
company_data = pd.read_csv("free-7-million-company-dataset.zip", compression = "zip")
company_data.head()

,Unnamed: 0,name,domain,year founded,industry,size range,locality,country,linkedin url,current employee estimate,total employee estimate,Unnamed: 11
0,5872184,ibm,ibm.com,1911,information technology and services,10001+,"new york, new york, united states",united states,linkedin.com/company/ibm,274047,716906,NaN
1,4425416,tata consultancy services,tcs.com,1968,information technology and services,10001+,"bombay, maharashtra, india",india,linkedin.com/company/tata-consultancy-services,190771,341369,NaN
2,21074,accenture,accenture.com,1989,information technology and services,10001+,"dublin, dublin, ireland",ireland,linkedin.com/company/accenture,190689,455768,NaN
3,2309813,us army,goarmy.com,1800,military,10001+,"alexandria, virginia, united states",united states,linkedin.com/company/us-army,162163,445958,NaN
4,1558607,ey,ey.com,1989,accounting,10001+,"london, greater london, united kingdom",united kingdom,linkedin.com/company/ernstandyoung,158363,428960,NaN

In [121]:
#Filter out companies without a domain name using pandas.
company_data.dropna(subset = ['domain'], inplace = True)

In [122]:
#save to csv
company_data.to_csv("free-7-million-company-dataset.csv")

In [123]:
#save to json
company_data.to_json("free-7-million-company-dataset.json.gzip", compression = 'gzip')

In [124]:
#convert dtypes to string
company_data = company_data.astype(str)

In [135]:
#save to parquet
company_data.to_parquet("free-7-million-company-dataset.parquet")

In [137]:
#upload the files
s3_client.upload_file('free-7-million-company-dataset.csv', 
                      bucket, 'project2/free-7-million-company-dataset.csv')

In [138]:
s3_client.upload_file('free-7-million-company-dataset.json.gzip', 
                      bucket, 'project2/free-7-million-company-dataset.json.gzip')
s3_client.upload_file('free-7-million-company-dataset.parquet', 
                      bucket, 'project2/free-7-million-company-dataset.parquet')